import styles from './Rules.module.scss'

function Rules(props){
    return(
        <div 
      // style = {isHowPlay?{}:{display:"none"}}
      className={styles.modal_bg}>
        <div className={styles.modal_wrapper}>
          <div className={styles.modal_close_button} onClick={props.onClickHowPlay}>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              fill="currentColor"
              viewBox="0 0 16 16"
            >
              <path d="M4.646 4.646a.5.5 0 0 1 .708 0L8 7.293l2.646-2.647a.5.5 0 0 1 .708.708L8.707 8l2.647 2.646a.5.5 0 0 1-.708.708L8 8.707l-2.646 2.647a.5.5 0 0 1-.708-.708L7.293 8 4.646 5.354a.5.5 0 0 1 0-.708z"></path>
            </svg>
            
          </div>
          <div className={styles.modal}>
              <div>
                <div className={styles.modal_title}>
                  <svg
                  className="pr-10"
                    xmlns="http://www.w3.org/2000/svg"
                    width="16"
                    height="16"
                    fill="currentColor"
                    viewBox="0 0 16 16"
                  >
                    <path d="M8 15A7 7 0 1 1 8 1a7 7 0 0 1 0 14zm0 1A8 8 0 1 0 8 0a8 8 0 0 0 0 16z"></path>
                    <path d="M5.255 5.786a.237.237 0 0 0 .241.247h.825c.138 0 .248-.113.266-.25.09-.656.54-1.134 1.342-1.134.686 0 1.314.343 1.314 1.168 0 .635-.374.927-.965 1.371-.673.489-1.206 1.06-1.168 1.987l.003.217a.25.25 0 0 0 .25.246h.811a.25.25 0 0 0 .25-.25v-.105c0-.718.273-.927 1.01-1.486.609-.463 1.244-.977 1.244-2.056 0-1.511-1.276-2.241-2.673-2.241-1.267 0-2.655.59-2.75 2.286zm1.557 5.763c0 .533.425.927 1.01.927.609 0 1.028-.394 1.028-.927 0-.552-.42-.94-1.029-.94-.584 0-1.009.388-1.009.94z"></path>
                  </svg>
                  <h2>Как играть</h2>
                </div>
                <p>
                  Найдите секретное слово. У вас неограниченное число попыток.
                </p>
                <p>
                  Слова располагаются с помощью AI алгоритма по порядку согласно
                  тому, как близко слово находится к секретному слову.
                </p>
                <p>
                  После того, как слово будет принято, вы увидите его позицию.
                  Позиция секретного слова - 1.
                </p>
                <p>
                  Алгорим проанализировал тысячи текстов. Он использует
                  контекст, в котором слова используются, чтобы рассчитать
                  близость между словами.
                </p>
              </div>
            </div>
        </div>
      </div>
    );
}

export default Rules;